In [4]:
import pandas as pd

In [5]:
dataset = pd.read_csv("SQLQuery.csv")

In [6]:
dataset.head()

                  datetime  Vancouver
0  2016-08-19 23:00:00.000     307.00
1  2016-08-19 22:00:00.000     306.69
2  2016-08-20 00:00:00.000     306.69
3  2016-08-20 01:00:00.000     306.06
4  2016-08-19 21:00:00.000     305.90

In [9]:
#the sql query

# SELECT TOP (1000) [datetime]
#       ,[Vancouver]
#       ,[Portland]
#       ,[San Francisco]
#       ,[Seattle]
#       ,[Los Angeles]
#       ,[San Diego]
#       ,[Las Vegas]
#       ,[Phoenix]
#       ,[Albuquerque]
#       ,[Denver]
#       ,[San Antonio]
#       ,[Dallas]
#       ,[Houston]
#       ,[Kansas City]
#       ,[Minneapolis]
#       ,[Saint Louis]
#       ,[Chicago]
#       ,[Nashville]
#       ,[Indianapolis]
#       ,[Atlanta]
#       ,[Detroit]
#       ,[Jacksonville]
#       ,[Charlotte]
#       ,[Miami]
#       ,[Pittsburgh]
#       ,[Toronto]
#       ,[Philadelphia]
#       ,[New York]
#       ,[Montreal]
#       ,[Boston]
#       ,[Beersheba]
#       ,[Tel Aviv District]
#       ,[Eilat]
#       ,[Haifa]
#       ,[Nahariyya]
#       ,[Jerusalem]
#   FROM [Data-Mining].[dbo].[temperature$]
#   ;WITH consecutiveValues AS (
#   SELECT *, Vancouver - ROW_NUMBER() OVER (ORDER BY Vancouver) AS dataGrouping
#   FROM  [Data-Mining].[dbo].[temperature$]
#   WHERE [Vancouver] > 9
# ),
# valuesCounted AS (
#   SELECT *, COUNT(*) OVER (PARTITION BY dataGrouping) AS consecutiveValueCount
#   FROM consecutiveValues
# )

# SELECT datetime, [Vancouver]
# FROM valuesCounted
# WHERE consecutiveValueCount >= 1